zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp255axx_cm0.h
/********************  Bits definition for TAMP_ATCR1 register  ***************/
#define TAMP_ATCR1_TAMP1AM_Pos       (0U)
#define TAMP_ATCR1_TAMP1AM_Msk       (0x1UL<<TAMP_ATCR1_TAMP1AM_Pos)                     /*!< 0x00000001U */
#define TAMP_ATCR1_TAMP1AM           TAMP_ATCR1_TAMP1AM_Msk
#define TAMP_ATCR1_TAMP2AM_Pos       (1U)
#define TAMP_ATCR1_TAMP2AM_Msk       (0x1UL<<TAMP_ATCR1_TAMP2AM_Pos)                     /*!< 0x00000002U */
#define TAMP_ATCR1_TAMP2AM           TAMP_ATCR1_TAMP2AM_Msk
#define TAMP_ATCR1_TAMP3AM_Pos       (2U)
#define TAMP_ATCR1_TAMP3AM_Msk       (0x1UL<<TAMP_ATCR1_TAMP3AM_Pos)                     /*!< 0x00000004U */
#define TAMP_ATCR1_TAMP3AM           TAMP_ATCR1_TAMP3AM_Msk
#define TAMP_ATCR1_TAMP4AM_Pos       (3U)
#define TAMP_ATCR1_TAMP4AM_Msk       (0x1UL<<TAMP_ATCR1_TAMP4AM_Pos)                     /*!< 0x00000008U */
#define TAMP_ATCR1_TAMP4AM           TAMP_ATCR1_TAMP4AM_Msk
#define TAMP_ATCR1_TAMP5AM_Pos       (4U)
#define TAMP_ATCR1_TAMP5AM_Msk       (0x1UL<<TAMP_ATCR1_TAMP5AM_Pos)                     /*!< 0x00000010U */
#define TAMP_ATCR1_TAMP5AM           TAMP_ATCR1_TAMP5AM_Msk
#define TAMP_ATCR1_TAMP6AM_Pos       (5U)
#define TAMP_ATCR1_TAMP6AM_Msk       (0x1UL<<TAMP_ATCR1_TAMP6AM_Pos)                     /*!< 0x00000010U */
#define TAMP_ATCR1_TAMP6AM           TAMP_ATCR1_TAMP6AM_Msk
#define TAMP_ATCR1_TAMP7AM_Pos       (6U)
#define TAMP_ATCR1_TAMP7AM_Msk       (0x1UL<<TAMP_ATCR1_TAMP7AM_Pos)                     /*!< 0x00000040U */
#define TAMP_ATCR1_TAMP7AM           TAMP_ATCR1_TAMP7AM_Msk
#define TAMP_ATCR1_TAMP8AM_Pos       (7U)
#define TAMP_ATCR1_TAMP8AM_Msk       (0x1UL<<TAMP_ATCR1_TAMP8AM_Pos)                     /*!< 0x00000080U */
#define TAMP_ATCR1_TAMP8AM           TAMP_ATCR1_TAMP8AM_Msk
#define TAMP_ATCR1_ATOSEL1_Pos       (8U)
#define TAMP_ATCR1_ATOSEL1_Msk       (0x3UL<<TAMP_ATCR1_ATOSEL1_Pos)                     /*!< 0x00000300U */
#define TAMP_ATCR1_ATOSEL1            TAMP_ATCR1_ATOSEL1_Msk
#define TAMP_ATCR1_ATOSEL1_0         (0x1UL << TAMP_ATCR1_ATOSEL1_Pos)                   /*!< 0x00000100U */
#define TAMP_ATCR1_ATOSEL1_1         (0x2UL << TAMP_ATCR1_ATOSEL1_Pos)                   /*!< 0x00000200U */
#define TAMP_ATCR1_ATOSEL2_Pos       (10U)
#define TAMP_ATCR1_ATOSEL2_Msk       (0x3UL<<TAMP_ATCR1_ATOSEL2_Pos)                     /*!< 0x00000C00U */
#define TAMP_ATCR1_ATOSEL2            TAMP_ATCR1_ATOSEL2_Msk
#define TAMP_ATCR1_ATOSEL2_0         (0x1UL << TAMP_ATCR1_ATOSEL2_Pos)                   /*!< 0x00000400U */
#define TAMP_ATCR1_ATOSEL2_1         (0x2UL << TAMP_ATCR1_ATOSEL2_Pos)                   /*!< 0x00000800U */
#define TAMP_ATCR1_ATOSEL3_Pos       (12U)
#define TAMP_ATCR1_ATOSEL3_Msk       (0x3UL<<TAMP_ATCR1_ATOSEL3_Pos)                     /*!< 0x00003000U */
#define TAMP_ATCR1_ATOSEL3            TAMP_ATCR1_ATOSEL3_Msk
#define TAMP_ATCR1_ATOSEL3_0         (0x1UL << TAMP_ATCR1_ATOSEL3_Pos)                   /*!< 0x00001000U */
#define TAMP_ATCR1_ATOSEL3_1         (0x2UL << TAMP_ATCR1_ATOSEL3_Pos)                   /*!< 0x00002000U */
#define TAMP_ATCR1_ATOSEL4_Pos       (14U)
#define TAMP_ATCR1_ATOSEL4_Msk       (0x3UL<<TAMP_ATCR1_ATOSEL4_Pos)                     /*!< 0x0000C000U */
#define TAMP_ATCR1_ATOSEL4            TAMP_ATCR1_ATOSEL4_Msk
#define TAMP_ATCR1_ATOSEL4_0         (0x1UL << TAMP_ATCR1_ATOSEL4_Pos)                   /*!< 0x00004000U */
#define TAMP_ATCR1_ATOSEL4_1         (0x2UL << TAMP_ATCR1_ATOSEL4_Pos)                   /*!< 0x00008000U */
#define TAMP_ATCR1_ATCKSEL_Pos       (16U)
#define TAMP_ATCR1_ATCKSEL_Msk       (0x7UL<<TAMP_ATCR1_ATCKSEL_Pos)                     /*!< 0x00070000U */
#define TAMP_ATCR1_ATCKSEL            TAMP_ATCR1_ATCKSEL_Msk
#define TAMP_ATCR1_ATCKSEL_0         (0x1UL << TAMP_ATCR1_ATCKSEL_Pos)                   /*!< 0x00010000U */
#define TAMP_ATCR1_ATCKSEL_1         (0x2UL << TAMP_ATCR1_ATCKSEL_Pos)                   /*!< 0x00020000U */
#define TAMP_ATCR1_ATCKSEL_2         (0x4UL << TAMP_ATCR1_ATCKSEL_Pos)                   /*!< 0x00040000U */
#define TAMP_ATCR1_ATCKSEL_3         (0x8UL << TAMP_ATCR1_ATCKSEL_Pos)                   /*!< 0x00080000U */
#define TAMP_ATCR1_ATPER_Pos         (24U)
#define TAMP_ATCR1_ATPER_Msk         (0xFUL<<TAMP_ATCR1_ATPER_Pos)                       /*!< 0x0F000000U */
#define TAMP_ATCR1_ATPER              TAMP_ATCR1_ATPER_Msk
#define TAMP_ATCR1_ATPER_0           (0x1UL << TAMP_ATCR1_ATPER_Pos)                     /*!< 0x01000000U */
#define TAMP_ATCR1_ATPER_1           (0x2UL << TAMP_ATCR1_ATPER_Pos)                     /*!< 0x02000000U */
#define TAMP_ATCR1_ATPER_2           (0x4UL << TAMP_ATCR1_ATPER_Pos)                     /*!< 0x04000000U */
#define TAMP_ATCR1_ATOSHARE_Pos      (30U)
#define TAMP_ATCR1_ATOSHARE_Msk      (0x1UL<<TAMP_ATCR1_ATOSHARE_Pos)                    /*!< 0x40000000U */
#define TAMP_ATCR1_ATOSHARE          TAMP_ATCR1_ATOSHARE_Msk
#define TAMP_ATCR1_FLTEN_Pos         (31U)
#define TAMP_ATCR1_FLTEN_Msk         (0x1UL<<TAMP_ATCR1_FLTEN_Pos)                       /*!< 0x80000000U */
#define TAMP_ATCR1_FLTEN             TAMP_ATCR1_FLTEN_Msk

/********************  Bits definition for TAMP_ATSEEDR register  ******************/
#define TAMP_ATSEEDR_SEED_Pos        (0U)
#define TAMP_ATSEEDR_SEED_Msk        (0xFFFFFFFFUL << TAMP_ATSEEDR_SEED_Pos)             /*!< 0xFFFFFFFFU */
#define TAMP_ATSEEDR_SEED            TAMP_ATSEEDR_SEED_Msk

/********************  Bits definition for TAMP_ATOR register  ******************/
#define TAMP_ATOR_PRNG_Pos           (0U)
#define TAMP_ATOR_PRNG_Msk           (0xFFUL << TAMP_ATOR_PRNG_Pos)                      /*!< 0x000000FFU */
#define TAMP_ATOR_PRNG               TAMP_ATOR_PRNG_Msk
#define TAMP_ATOR_PRNG_0             (0x1UL << TAMP_ATOR_PRNG_Pos)                      /*!< 0x00000001U */
#define TAMP_ATOR_PRNG_1             (0x2UL << TAMP_ATOR_PRNG_Pos)                      /*!< 0x00000002U */
#define TAMP_ATOR_PRNG_2             (0x4UL << TAMP_ATOR_PRNG_Pos)                      /*!< 0x00000004U */
#define TAMP_ATOR_PRNG_3             (0x8UL << TAMP_ATOR_PRNG_Pos)                      /*!< 0x00000008U */
#define TAMP_ATOR_PRNG_4             (0x10UL << TAMP_ATOR_PRNG_Pos)                     /*!< 0x00000010U */
#define TAMP_ATOR_PRNG_5             (0x20UL << TAMP_ATOR_PRNG_Pos)                     /*!< 0x00000020U */
#define TAMP_ATOR_PRNG_6             (0x40UL << TAMP_ATOR_PRNG_Pos)                     /*!< 0x00000040U */
#define TAMP_ATOR_PRNG_7             (0x80UL << TAMP_ATOR_PRNG_Pos)                     /*!< 0x00000080U */
#define TAMP_ATOR_SEEDF_Pos          (14U)
#define TAMP_ATOR_SEEDF_Msk          (1UL << TAMP_ATOR_SEEDF_Pos)                       /*!< 0x00004000U */
#define TAMP_ATOR_SEEDF              TAMP_ATOR_SEEDF_Msk
#define TAMP_ATOR_INITS_Pos          (15U)
#define TAMP_ATOR_INITS_Msk          (1UL << TAMP_ATOR_INITS_Pos)                       /*!< 0x00008000U */
#define TAMP_ATOR_INITS              TAMP_ATOR_INITS_Msk

/********************  Bits definition for TAMP_ATCR2 register  ***************/
#define TAMP_ATCR2_ATOSEL1_Pos       (8U)
#define TAMP_ATCR2_ATOSEL1_Msk       (0x7UL<<TAMP_ATCR2_ATOSEL1_Pos)                    /*!< 0x00000700U */
#define TAMP_ATCR2_ATOSEL1            TAMP_ATCR2_ATOSEL1_Msk
#define TAMP_ATCR2_ATOSEL1_0         (0x1UL << TAMP_ATCR2_ATOSEL1_Pos)                  /*!< 0x00000100U */
#define TAMP_ATCR2_ATOSEL1_1         (0x2UL << TAMP_ATCR2_ATOSEL1_Pos)                  /*!< 0x00000200U */
#define TAMP_ATCR2_ATOSEL1_2         (0x4UL << TAMP_ATCR2_ATOSEL1_Pos)                  /*!< 0x00000400U */
#define TAMP_ATCR2_ATOSEL2_Pos       (11U)
#define TAMP_ATCR2_ATOSEL2_Msk       (0x7UL<<TAMP_ATCR2_ATOSEL2_Pos)                    /*!< 0x00003800U */
#define TAMP_ATCR2_ATOSEL2            TAMP_ATCR2_ATOSEL2_Msk
#define TAMP_ATCR2_ATOSEL2_0         (0x1UL << TAMP_ATCR2_ATOSEL2_Pos)                  /*!< 0x00000800U */
#define TAMP_ATCR2_ATOSEL2_1         (0x2UL << TAMP_ATCR2_ATOSEL2_Pos)                  /*!< 0x00001000U */
#define TAMP_ATCR2_ATOSEL2_2         (0x4UL << TAMP_ATCR2_ATOSEL2_Pos)                  /*!< 0x00002000U */
#define TAMP_ATCR2_ATOSEL3_Pos       (14U)
#define TAMP_ATCR2_ATOSEL3_Msk       (0x7UL<<TAMP_ATCR2_ATOSEL3_Pos)                    /*!< 0x0001C000U */
#define TAMP_ATCR2_ATOSEL3            TAMP_ATCR2_ATOSEL3_Msk
#define TAMP_ATCR2_ATOSEL3_0         (0x1UL << TAMP_ATCR2_ATOSEL3_Pos)                  /*!< 0x00004000U */
#define TAMP_ATCR2_ATOSEL3_1         (0x2UL << TAMP_ATCR2_ATOSEL3_Pos)                  /*!< 0x00008000U */
#define TAMP_ATCR2_ATOSEL3_2         (0x4UL << TAMP_ATCR2_ATOSEL3_Pos)                  /*!< 0x00010000U */
#define TAMP_ATCR2_ATOSEL4_Pos       (17U)
#define TAMP_ATCR2_ATOSEL4_Msk       (0x7UL<<TAMP_ATCR2_ATOSEL4_Pos)                    /*!< 0x000E0000U */
#define TAMP_ATCR2_ATOSEL4            TAMP_ATCR2_ATOSEL4_Msk
#define TAMP_ATCR2_ATOSEL4_0         (0x1UL << TAMP_ATCR2_ATOSEL4_Pos)                  /*!< 0x00020000U */
#define TAMP_ATCR2_ATOSEL4_1         (0x2UL << TAMP_ATCR2_ATOSEL4_Pos)                  /*!< 0x00040000U */
#define TAMP_ATCR2_ATOSEL4_2         (0x4UL << TAMP_ATCR2_ATOSEL4_Pos)                  /*!< 0x00080000U */
#define TAMP_ATCR2_ATOSEL5_Pos       (20U)
#define TAMP_ATCR2_ATOSEL5_Msk       (0x7UL<<TAMP_ATCR2_ATOSEL5_Pos)                    /*!< 0x00700000U */
#define TAMP_ATCR2_ATOSEL5            TAMP_ATCR2_ATOSEL5_Msk
#define TAMP_ATCR2_ATOSEL5_0         (0x1UL << TAMP_ATCR2_ATOSEL5_Pos)                  /*!< 0x00100000U */
#define TAMP_ATCR2_ATOSEL5_1         (0x2UL << TAMP_ATCR2_ATOSEL5_Pos)                  /*!< 0x00200000U */
#define TAMP_ATCR2_ATOSEL5_2         (0x4UL << TAMP_ATCR2_ATOSEL5_Pos)                  /*!< 0x00400000U */
#define TAMP_ATCR2_ATOSEL6_Pos       (23U)
#define TAMP_ATCR2_ATOSEL6_Msk       (0x7UL<<TAMP_ATCR2_ATOSEL6_Pos)                    /*!< 0x03800000U */
#define TAMP_ATCR2_ATOSEL6            TAMP_ATCR2_ATOSEL6_Msk
#define TAMP_ATCR2_ATOSEL6_0         (0x1UL << TAMP_ATCR2_ATOSEL6_Pos)                  /*!< 0x00800000U */
#define TAMP_ATCR2_ATOSEL6_1         (0x2UL << TAMP_ATCR2_ATOSEL6_Pos)                  /*!< 0x01000000U */
#define TAMP_ATCR2_ATOSEL6_2         (0x4UL << TAMP_ATCR2_ATOSEL6_Pos)                  /*!< 0x02000000U */
#define TAMP_ATCR2_ATOSEL7_Pos       (26U)
#define TAMP_ATCR2_ATOSEL7_Msk       (0x7UL<<TAMP_ATCR2_ATOSEL7_Pos)                    /*!< 0x1C000000U */
#define TAMP_ATCR2_ATOSEL7            TAMP_ATCR2_ATOSEL7_Msk
#define TAMP_ATCR2_ATOSEL7_0         (0x1UL << TAMP_ATCR2_ATOSEL7_Pos)                  /*!< 0x04000000U */
#define TAMP_ATCR2_ATOSEL7_1         (0x2UL << TAMP_ATCR2_ATOSEL7_Pos)                  /*!< 0x08000000U */
#define TAMP_ATCR2_ATOSEL7_2         (0x4UL << TAMP_ATCR2_ATOSEL7_Pos)                  /*!< 0x10000000U */
#define TAMP_ATCR2_ATOSEL8_Pos       (29U)
#define TAMP_ATCR2_ATOSEL8_Msk       (0x7UL<<TAMP_ATCR2_ATOSEL8_Pos)                    /*!< 0xE0000000U */
#define TAMP_ATCR2_ATOSEL8            TAMP_ATCR2_ATOSEL8_Msk
#define TAMP_ATCR2_ATOSEL8_0         (0x1UL << TAMP_ATCR2_ATOSEL8_Pos)                  /*!< 0x20000000U */
#define TAMP_ATCR2_ATOSEL8_1         (0x2UL << TAMP_ATCR2_ATOSEL8_Pos)                  /*!< 0x40000000U */
#define TAMP_ATCR2_ATOSEL8_2         (0x4UL << TAMP_ATCR2_ATOSEL8_Pos)                  /*!< 0x80000000U */

/********************  Bits definition for TAMP_SECCFGR register  *************/
#define TAMP_SECCFGR_BKPRWSEC_Pos     (0U)
#define TAMP_SECCFGR_BKPRWSEC_Msk     (0xFFUL << TAMP_SECCFGR_BKPRWSEC_Pos)                /*!< 0x000000FFU */
#define TAMP_SECCFGR_BKPRWSEC         TAMP_SECCFGR_BKPRWSEC_Msk
#define TAMP_SECCFGR_BKPRWSEC_0       (0x1UL << TAMP_SECCFGR_BKPRWSEC_Pos)                /*!< 0x00000001U */
#define TAMP_SECCFGR_BKPRWSEC_1       (0x2UL << TAMP_SECCFGR_BKPRWSEC_Pos)                /*!< 0x00000002U */
#define TAMP_SECCFGR_BKPRWSEC_2       (0x4UL << TAMP_SECCFGR_BKPRWSEC_Pos)                /*!< 0x00000004U */
#define TAMP_SECCFGR_BKPRWSEC_3       (0x8UL << TAMP_SECCFGR_BKPRWSEC_Pos)                /*!< 0x00000008U */
#define TAMP_SECCFGR_BKPRWSEC_4       (0x1UL << TAMP_SECCFGR_BKPRWSEC_Pos)                /*!< 0x00000010U */
#define TAMP_SECCFGR_BKPRWSEC_5       (0x20UL << TAMP_SECCFGR_BKPRWSEC_Pos)               /*!< 0x00000020U */
#define TAMP_SECCFGR_BKPRWSEC_6       (0x40UL << TAMP_SECCFGR_BKPRWSEC_Pos)               /*!< 0x00000040U */
#define TAMP_SECCFGR_BKPRWSEC_7       (0x80UL << TAMP_SECCFGR_BKPRWSEC_Pos)               /*!< 0x00000080U */
#define TAMP_SECCFGR_CNT2SEC_Pos      (14U)
#define TAMP_SECCFGR_CNT2SEC_Msk      (0x1UL << TAMP_SECCFGR_CNT2SEC_Pos)                  /*!< 0x00004000U */
#define TAMP_SECCFGR_CNT2SEC          TAMP_SECCFGR_CNT2SEC_Msk
#define TAMP_SECCFGR_CNT1SEC_Pos      (15U)
#define TAMP_SECCFGR_CNT1SEC_Msk      (0x1UL << TAMP_SECCFGR_CNT1SEC_Pos)                  /*!< 0x00008000U */
#define TAMP_SECCFGR_CNT1SEC          TAMP_SECCFGR_CNT1SEC_Msk
#define TAMP_SECCFGR_BKPWSEC_Pos      (16U)
#define TAMP_SECCFGR_BKPWSEC_Msk      (0xFFUL << TAMP_SECCFGR_BKPWSEC_Pos)                 /*!< 0x00FF0000U */
#define TAMP_SECCFGR_BKPWSEC          TAMP_SECCFGR_BKPWSEC_Msk
#define TAMP_SECCFGR_BKPWSEC_0        (0x1UL << TAMP_SECCFGR_BKPWSEC_Pos)                 /*!< 0x00010000U */
#define TAMP_SECCFGR_BKPWSEC_1        (0x2UL << TAMP_SECCFGR_BKPWSEC_Pos)                 /*!< 0x00020000U */
#define TAMP_SECCFGR_BKPWSEC_2        (0x4UL << TAMP_SECCFGR_BKPWSEC_Pos)                 /*!< 0x00040000U */
#define TAMP_SECCFGR_BKPWSEC_3        (0x8UL << TAMP_SECCFGR_BKPWSEC_Pos)                 /*!< 0x00080000U */
#define TAMP_SECCFGR_BKPWSEC_4        (0x1UL << TAMP_SECCFGR_BKPWSEC_Pos)                 /*!< 0x00100000U */
#define TAMP_SECCFGR_BKPWSEC_5        (0x20UL << TAMP_SECCFGR_BKPWSEC_Pos)                /*!< 0x00200000U */
#define TAMP_SECCFGR_BKPWSEC_6        (0x40UL << TAMP_SECCFGR_BKPWSEC_Pos)                /*!< 0x00400000U */
#define TAMP_SECCFGR_BKPWSEC_7        (0x80UL << TAMP_SECCFGR_BKPWSEC_Pos)                /*!< 0x00800000U */
#define TAMP_SECCFGR_SMKLOCK_Pos      (30U)
#define TAMP_SECCFGR_SMKLOCK_Msk      (0x1UL << TAMP_SECCFGR_SMKLOCK_Pos)                 /*!< 0x40000000U */
#define TAMP_SECCFGR_SMKLOCK          TAMP_SECCFGR_SMKLOCK_Msk
#define TAMP_SECCFGR_TAMPSEC_Pos      (31U)
#define TAMP_SECCFGR_TAMPSEC_Msk      (0x1UL << TAMP_SECCFGR_TAMPSEC_Pos)                 /*!< 0x80000000U */
#define TAMP_SECCFGR_TAMPSEC          TAMP_SECCFGR_TAMPSEC_Msk

/********************  Bits definition for TAMP_PRIVCR register  ************/
#define TAMP_PRIVCR_CNT2PRIV_Pos    (15U)
#define TAMP_PRIVCR_CNT2PRIV_Msk    (0x1UL << TAMP_PRIVCR_CNT2PRIV_Pos)                /*!< 0x00004000U */
#define TAMP_PRIVCR_CNT2PRIV        TAMP_PRIVCR_CNT2PRIV_Msk
#define TAMP_PRIVCR_CNT1PRIV_Pos    (15U)
#define TAMP_PRIVCR_CNT1PRIV_Msk    (0x1UL << TAMP_PRIVCR_CNT1PRIV_Pos)                /*!< 0x00008000U */
#define TAMP_PRIVCR_CNT1PRIV        TAMP_PRIVCR_CNT1PRIV_Msk
#define TAMP_PRIVCR_BKPRWPRIV_Pos   (29U)
#define TAMP_PRIVCR_BKPRWPRIV_Msk   (0x1UL << TAMP_PRIVCR_BKPRWPRIV_Pos)               /*!< 0x20000000U */
#define TAMP_PRIVCR_BKPRWPRIV       TAMP_PRIVCR_BKPRWPRIV_Msk
#define TAMP_PRIVCR_BKPWPRIV_Pos    (30U)
#define TAMP_PRIVCR_BKPWPRIV_Msk    (0x1UL << TAMP_PRIVCR_BKPWPRIV_Pos)                /*!< 0x40000000U */
#define TAMP_PRIVCR_BKPWPRIV        TAMP_PRIVCR_BKPWPRIV_Msk
#define TAMP_PRIVCR_TAMPPRIV_Pos    (31U)
#define TAMP_PRIVCR_TAMPPRIV_Msk    (0x1UL << TAMP_PRIVCR_TAMPPRIV_Pos)                /*!< 0x80000000U */
#define TAMP_PRIVCR_TAMPPRIV        TAMP_PRIVCR_TAMPPRIV_Msk

/********************  Bits definition for TAMP_IER register  *****************/
#define TAMP_IER_TAMP1IE_Pos         (0U)
#define TAMP_IER_TAMP1IE_Msk         (0x1UL << TAMP_IER_TAMP1IE_Pos)                    /*!< 0x00000001U */
#define TAMP_IER_TAMP1IE             TAMP_IER_TAMP1IE_Msk
#define TAMP_IER_TAMP2IE_Pos         (1U)
#define TAMP_IER_TAMP2IE_Msk         (0x1UL << TAMP_IER_TAMP2IE_Pos)                    /*!< 0x00000002U */
#define TAMP_IER_TAMP2IE             TAMP_IER_TAMP2IE_Msk
#define TAMP_IER_TAMP3IE_Pos         (2U)
#define TAMP_IER_TAMP3IE_Msk         (0x1UL << TAMP_IER_TAMP3IE_Pos)                    /*!< 0x00000004U */
#define TAMP_IER_TAMP3IE             TAMP_IER_TAMP3IE_Msk
#define TAMP_IER_TAMP4IE_Pos         (3U)
#define TAMP_IER_TAMP4IE_Msk         (0x1UL << TAMP_IER_TAMP4IE_Pos)                    /*!< 0x00000008U */
#define TAMP_IER_TAMP4IE             TAMP_IER_TAMP4IE_Msk
#define TAMP_IER_TAMP5IE_Pos         (4U)
#define TAMP_IER_TAMP5IE_Msk         (0x1UL << TAMP_IER_TAMP5IE_Pos)                    /*!< 0x00000010U */
#define TAMP_IER_TAMP5IE             TAMP_IER_TAMP5IE_Msk
#define TAMP_IER_TAMP6IE_Pos         (5U)
#define TAMP_IER_TAMP6IE_Msk         (0x1UL << TAMP_IER_TAMP6IE_Pos)                    /*!< 0x00000020U */
#define TAMP_IER_TAMP6IE             TAMP_IER_TAMP6IE_Msk
#define TAMP_IER_TAMP7IE_Pos         (6U)
#define TAMP_IER_TAMP7IE_Msk         (0x1UL << TAMP_IER_TAMP7IE_Pos)                    /*!< 0x00000040U */
#define TAMP_IER_TAMP7IE             TAMP_IER_TAMP7IE_Msk
#define TAMP_IER_TAMP8IE_Pos         (7U)
#define TAMP_IER_TAMP8IE_Msk         (0x1UL << TAMP_IER_TAMP8IE_Pos)                    /*!< 0x00000080U */
#define TAMP_IER_TAMP8IE             TAMP_IER_TAMP8IE_Msk
#define TAMP_IER_ITAMP1IE_Pos        (16U)
#define TAMP_IER_ITAMP1IE_Msk        (0x1UL << TAMP_IER_ITAMP1IE_Pos)                   /*!< 0x00010000U */
#define TAMP_IER_ITAMP1IE            TAMP_IER_ITAMP1IE_Msk
#define TAMP_IER_ITAMP2IE_Pos        (17U)
#define TAMP_IER_ITAMP2IE_Msk        (0x1UL << TAMP_IER_ITAMP2IE_Pos)                   /*!< 0x00020000U */
#define TAMP_IER_ITAMP2IE            TAMP_IER_ITAMP2IE_Msk
#define TAMP_IER_ITAMP3IE_Pos        (18U)
#define TAMP_IER_ITAMP3IE_Msk        (0x1UL << TAMP_IER_ITAMP3IE_Pos)                   /*!< 0x00040000U */
#define TAMP_IER_ITAMP3IE            TAMP_IER_ITAMP3IE_Msk
#define TAMP_IER_ITAMP4IE_Pos        (19U)
#define TAMP_IER_ITAMP4IE_Msk        (0x1UL << TAMP_IER_ITAMP4IE_Pos)                   /*!< 0x00040000U */
#define TAMP_IER_ITAMP4IE            TAMP_IER_ITAMP4IE_Msk
#define TAMP_IER_ITAMP5IE_Pos        (20U)
#define TAMP_IER_ITAMP5IE_Msk        (0x1UL << TAMP_IER_ITAMP5IE_Pos)                   /*!< 0x00100000U */
#define TAMP_IER_ITAMP5IE            TAMP_IER_ITAMP5IE_Msk
#define TAMP_IER_ITAMP6IE_Pos        (21U)
#define TAMP_IER_ITAMP6IE_Msk        (0x1UL << TAMP_IER_ITAMP6IE_Pos)                   /*!< 0x00200000U */
#define TAMP_IER_ITAMP6IE            TAMP_IER_ITAMP6IE_Msk
#define TAMP_IER_ITAMP7IE_Pos        (22U)
#define TAMP_IER_ITAMP7IE_Msk        (0x1UL << TAMP_IER_ITAMP7IE_Pos)                   /*!< 0x00400000U */
#define TAMP_IER_ITAMP7IE            TAMP_IER_ITAMP7IE_Msk
#define TAMP_IER_ITAMP8IE_Pos        (23U)
#define TAMP_IER_ITAMP8IE_Msk        (0x1UL << TAMP_IER_ITAMP8IE_Pos)                   /*!< 0x00800000U */
#define TAMP_IER_ITAMP8IE            TAMP_IER_ITAMP8IE_Msk
#define TAMP_IER_ITAMP9IE_Pos        (24U)
#define TAMP_IER_ITAMP9IE_Msk        (0x1UL << TAMP_IER_ITAMP9IE_Pos)                   /*!< 0x01000000U */
#define TAMP_IER_ITAMP9IE            TAMP_IER_ITAMP9IE_Msk
#define TAMP_IER_ITAMP10IE_Pos       (25U)
#define TAMP_IER_ITAMP10IE_Msk       (0x1UL << TAMP_IER_ITAMP10IE_Pos)                  /*!< 0x02000000U */
#define TAMP_IER_ITAMP10IE           TAMP_IER_ITAMP10IE_Msk
#define TAMP_IER_ITAMP11IE_Pos       (26U)
#define TAMP_IER_ITAMP11IE_Msk       (0x1UL << TAMP_IER_ITAMP11IE_Pos)                  /*!< 0x04000000U */
#define TAMP_IER_ITAMP11IE           TAMP_IER_ITAMP11IE_Msk
#define TAMP_IER_ITAMP12IE_Pos       (27U)
#define TAMP_IER_ITAMP12IE_Msk       (0x1UL << TAMP_IER_ITAMP12IE_Pos)                  /*!< 0x08000000U */
#define TAMP_IER_ITAMP12IE           TAMP_IER_ITAMP12IE_Msk
#define TAMP_IER_ITAMP14IE_Pos       (29U)
#define TAMP_IER_ITAMP14IE_Msk       (0x1UL << TAMP_IER_ITAMP14IE_Pos)                  /*!< 0x20000000U */
#define TAMP_IER_ITAMP14IE           TAMP_IER_ITAMP14IE_Msk
#define TAMP_IER_ITAMP15IE_Pos       (30U)
#define TAMP_IER_ITAMP15IE_Msk       (0x1UL << TAMP_IER_ITAMP15IE_Pos)                  /*!< 0x40000000U */
#define TAMP_IER_ITAMP15IE           TAMP_IER_ITAMP15IE_Msk

