zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp255axx_cm0.h
/*******************  Bits definition for TAMP_IPIDR register  **************/
#define TAMP_IPIDR_ID_Pos               (0U)
#define TAMP_IPIDR_ID_Msk               (0xFFFFFFFFUL << TAMP_IPIDR_ID_Pos)          /*!< 0xFFFFFFFF */
#define TAMP_IPIDR_ID                   TAMP_IPIDR_ID_Msk                            /*!< TAMP ID */

/*******************  Bits definition for TAMP_SIDR register  **************/
#define TAMP_SIDR_SID_Pos               (0U)
#define TAMP_SIDR_SID_Msk               (0xFFFFFFFFUL << TAMP_SIDR_SID_Pos)          /*!< 0xFFFFFFFF */
#define TAMP_SIDR_SID                   TAMP_SIDR_SID_Msk                            /*!< TAMP Size ID */

/******************************************************************************/
/*                                                                            */
/*      Universal Synchronous Asynchronous Receiver Transmitter (USART)       */
/*                                                                            */
/******************************************************************************/
/* c7amba_sci3_v3.0 */
/******************  Bit definition for USART_CR1 register  *******************/
/******************  Bit definition for USART_CR1 register  *******************/
#define USART_CR1_UE_Pos               (0U)
#define USART_CR1_UE_Msk               (0x1UL << USART_CR1_UE_Pos)  /*!< 0x00000001 */
#define USART_CR1_UE                   USART_CR1_UE_Msk            /*!< USART enable */
#define USART_CR1_UESM_Pos             (1U)
#define USART_CR1_UESM_Msk             (0x1UL << USART_CR1_UESM_Pos)/*!< 0x00000002 */
#define USART_CR1_UESM                 USART_CR1_UESM_Msk          /*!< USART enable in low-power mode  */
#define USART_CR1_RE_Pos               (2U)
#define USART_CR1_RE_Msk               (0x1UL << USART_CR1_RE_Pos)  /*!< 0x00000004 */
#define USART_CR1_RE                   USART_CR1_RE_Msk            /*!< Receiver enable */
#define USART_CR1_TE_Pos               (3U)
#define USART_CR1_TE_Msk               (0x1UL << USART_CR1_TE_Pos)  /*!< 0x00000008 */
#define USART_CR1_TE                   USART_CR1_TE_Msk            /*!< Transmitter enable */
#define USART_CR1_IDLEIE_Pos           (4U)
#define USART_CR1_IDLEIE_Msk           (0x1UL << USART_CR1_IDLEIE_Pos)  /*!< 0x00000010 */
#define USART_CR1_IDLEIE               USART_CR1_IDLEIE_Msk        /*!< IDLE interrupt enable */
#define USART_CR1_RXFNEIE_Pos          (5U)
#define USART_CR1_RXFNEIE_Msk          (0x1UL << USART_CR1_RXFNEIE_Pos)   /*!< 0x00000020 */
#define USART_CR1_RXFNEIE              USART_CR1_RXFNEIE_Msk       /*!< RXFIFO not empty interrupt enable */
#define USART_CR1_RXNEIE_RXFNEIE_Pos   USART_CR1_RXFNEIE_Pos
#define USART_CR1_RXNEIE_RXFNEIE_Msk   USART_CR1_RXFNEIE_Msk                      /*!< 0x00000020 */
#define USART_CR1_RXNEIE_RXFNEIE       USART_CR1_RXFNEIE_Msk                      /*!< RXNE and RX FIFO Not Empty Interrupt Enable */
#define USART_CR1_TCIE_Pos             (6U)
#define USART_CR1_TCIE_Msk             (0x1UL << USART_CR1_TCIE_Pos)/*!< 0x00000040 */
#define USART_CR1_TCIE                 USART_CR1_TCIE_Msk          /*!< Transmission complete interrupt enable */
#define USART_CR1_TXFNFIE_Pos          (7U)
#define USART_CR1_TXFNFIE_Msk          (0x1UL << USART_CR1_TXFNFIE_Pos)   /*!< 0x00000080 */
#define USART_CR1_TXFNFIE              USART_CR1_TXFNFIE_Msk       /*!< TXFIFO not full interrupt enable */
#define USART_CR1_TXEIE_TXFNFIE_Pos    USART_CR1_TXFNFIE_Pos
#define USART_CR1_TXEIE_TXFNFIE_Msk    USART_CR1_TXFNFIE_Msk                       /*!< 0x00000080 */
#define USART_CR1_TXEIE_TXFNFIE        USART_CR1_TXFNFIE_Msk                       /*!< TXE and TX FIFO Not Full Interrupt Enable */
#define USART_CR1_PEIE_Pos             (8U)
#define USART_CR1_PEIE_Msk             (0x1UL << USART_CR1_PEIE_Pos)/*!< 0x00000100 */
#define USART_CR1_PEIE                 USART_CR1_PEIE_Msk          /*!< PE interrupt enable */
#define USART_CR1_PS_Pos               (9U)
#define USART_CR1_PS_Msk               (0x1UL << USART_CR1_PS_Pos)  /*!< 0x00000200 */
#define USART_CR1_PS                   USART_CR1_PS_Msk            /*!< Parity selection */
#define USART_CR1_PCE_Pos              (10U)
#define USART_CR1_PCE_Msk              (0x1UL << USART_CR1_PCE_Pos) /*!< 0x00000400 */
#define USART_CR1_PCE                  USART_CR1_PCE_Msk           /*!< Parity control enable */
#define USART_CR1_WAKE_Pos             (11U)
#define USART_CR1_WAKE_Msk             (0x1UL << USART_CR1_WAKE_Pos)/*!< 0x00000800 */
#define USART_CR1_WAKE                 USART_CR1_WAKE_Msk          /*!< Receiver wakeup method */
#define USART_CR1_M_Pos                (12U)
#define USART_CR1_M_Msk                (0x10001UL << USART_CR1_M_Pos)             /*!< 0x10001000 */
#define USART_CR1_M                    USART_CR1_M_Msk                           /*!< Word length */
#define USART_CR1_M0_Pos               (12U)
#define USART_CR1_M0_Msk               (0x1UL << USART_CR1_M0_Pos)  /*!< 0x00001000 */
#define USART_CR1_M0                   USART_CR1_M0_Msk            /*!< Word length */
#define USART_CR1_MME_Pos              (13U)
#define USART_CR1_MME_Msk              (0x1UL << USART_CR1_MME_Pos) /*!< 0x00002000 */
#define USART_CR1_MME                  USART_CR1_MME_Msk           /*!< Mute mode enable */
#define USART_CR1_CMIE_Pos             (14U)
#define USART_CR1_CMIE_Msk             (0x1UL << USART_CR1_CMIE_Pos)/*!< 0x00004000 */
#define USART_CR1_CMIE                 USART_CR1_CMIE_Msk          /*!< Character match interrupt enable */
#define USART_CR1_OVER8_Pos            (15U)
#define USART_CR1_OVER8_Msk            (0x1UL << USART_CR1_OVER8_Pos) /*!< 0x00008000 */
#define USART_CR1_OVER8                USART_CR1_OVER8_Msk         /*!< Oversampling mode */
#define USART_CR1_DEDT_Pos             (16U)
#define USART_CR1_DEDT_Msk             (0x1FUL << USART_CR1_DEDT_Pos) /*!< 0x001F0000 */
#define USART_CR1_DEDT                 USART_CR1_DEDT_Msk          /*!< Driver Enable deassertion time */
#define USART_CR1_DEAT_Pos             (21U)
#define USART_CR1_DEAT_Msk             (0x1FUL << USART_CR1_DEAT_Pos) /*!< 0x03E00000 */
#define USART_CR1_DEAT                 USART_CR1_DEAT_Msk          /*!< Driver Enable assertion time */
#define USART_CR1_RTOIE_Pos            (26U)
#define USART_CR1_RTOIE_Msk            (0x1UL << USART_CR1_RTOIE_Pos) /*!< 0x04000000 */
#define USART_CR1_RTOIE                USART_CR1_RTOIE_Msk         /*!< Receiver timeout interrupt enable */
#define USART_CR1_EOBIE_Pos            (27U)
#define USART_CR1_EOBIE_Msk            (0x1UL << USART_CR1_EOBIE_Pos) /*!< 0x08000000 */
#define USART_CR1_EOBIE                USART_CR1_EOBIE_Msk         /*!< End of Block interrupt enable */
#define USART_CR1_M1_Pos               (28U)
#define USART_CR1_M1_Msk               (0x1UL << USART_CR1_M1_Pos)  /*!< 0x10000000 */
#define USART_CR1_M1                   USART_CR1_M1_Msk            /*!< Word length */
#define USART_CR1_FIFOEN_Pos           (29U)
#define USART_CR1_FIFOEN_Msk           (0x1UL << USART_CR1_FIFOEN_Pos)  /*!< 0x20000000 */
#define USART_CR1_FIFOEN               USART_CR1_FIFOEN_Msk        /*!< FIFO mode enable */
#define USART_CR1_TXFEIE_Pos           (30U)
#define USART_CR1_TXFEIE_Msk           (0x1UL << USART_CR1_TXFEIE_Pos)  /*!< 0x40000000 */
#define USART_CR1_TXFEIE               USART_CR1_TXFEIE_Msk        /*!< TXFIFO empty interrupt enable */
#define USART_CR1_RXFFIE_Pos           (31U)
#define USART_CR1_RXFFIE_Msk           (0x1UL << USART_CR1_RXFFIE_Pos)  /*!< 0x80000000 */
#define USART_CR1_RXFFIE               USART_CR1_RXFFIE_Msk        /*!< RXFIFO Full interrupt enable */

